Revit 2027 API
NavisworksExportOptions.ExportRoomGeometry Property
 True to export Revit room geometry, false otherwise. Default value is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportRoomGeometry { get; set; }
Public Property ExportRoomGeometry As Boolean
	Get
	Set
public:
property bool ExportRoomGeometry {
	bool get ();
	void set (bool value);
}
member ExportRoomGeometry : bool with get, set
Property Value
Boolean
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace